<img src="https://i.redd.it/3ueb26gco5a41.jpg" width=300 height=350 />

# PYTHON PANDAS

<h4>Pandas is defined as an open-source library that provides high-performance data manipulation in 
Python.<br><br>
It is used for data analysis in Python.<br><br>
Before Pandas, Python was capable for data preparation, but it only provided limited support for 
data analysis. So, Pandas came into the picture and enhanced the capabilities of data analysis. <br>It 
can perform five significant steps required for processing and analysis of data irrespective of the 
origin of the data, i.e., load, manipulate, prepare, model, and analyze.

# Why Use Pandas?

Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

There are three basic data structure in pandas.

1)  Pandas series<br>
2)  Dataframe

## Series

In [4]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [5]:
a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [6]:
# Create a simple Pandas Series from a dictionary:

calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

## DataFrames

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.

In [7]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

myvar = pd.DataFrame(data)

print(myvar)

   calories  duration
0       420        50
1       380        40
2       390        45

### Locate Row

Pandas use the loc attribute to return one or more specified row(s)

In [9]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

print(df) 
#refer to the row index:
print(df.loc[0])

   calories  duration
0       420        50
1       380        40
2       390        45
calories    420
duration     50
Name: 0, dtype: int64

In [10]:
print(df.loc[[0, 1]])

   calories  duration
0       420        50
1       380        40

In [11]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

df = pd.DataFrame(data, index = ["day1", "day2", "day3"])

print(df)

      calories  duration
day1       420        50
day2       380        40
day3       390        45

# Pandas Read CSV

In [12]:
import pandas as pd

df = pd.read_csv('tips.csv')

print(df)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# Pandas - Analyzing DataFrames

In [13]:
print(df.head(10))

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [14]:
print(df.tail(10))

     total_bill   tip     sex smoker   day    time  size
234       15.53  3.00    Male    Yes   Sat  Dinner     2
235       10.07  1.25    Male     No   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [15]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB
None

# Data Pre-Processing

Data preprocessing is a process of preparing the raw data and making it suitable for a machine learning model.<br> It is the first and crucial step while creating a machine learning model.

Imp Steps In Preprocessing

->Getting the dataset<br>
->Importing libraries<br>
->Importing datasets<br>
->Finding Missing Data<br>
->Encoding Categorical Data<br>
->Splitting dataset into training and test set<br>
->Feature scaling

In [20]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'Part': ['Monitor', 'CPU', None, 'Mouse', None, 'Extensions', 'Table', 'Chair', 'Wifi'],
    'Feature': ['LED', 'i7', 'RGB', 'Wireless', 'Zebronics', None, 'Urban Clap', 'Apex Chairs', 'Airtel'],
    'Price': [12000, 3500, None, 1200, None, 250, 7000, 12000, 799]
})
print(df)

         Part      Feature    Price
0     Monitor          LED  12000.0
1         CPU           i7   3500.0
2        None          RGB      NaN
3       Mouse     Wireless   1200.0
4        None    Zebronics      NaN
5  Extensions         None    250.0
6       Table   Urban Clap   7000.0
7       Chair  Apex Chairs  12000.0
8        Wifi       Airtel    799.0

### Check For NAN

In [21]:
data = {'Number':[1,2,3,4,np.nan,5,6,np.nan,7,8]}
df = pd.DataFrame(data)
print(df ,"\n\n")
check = df['Number'].isnull().values.any()
print(check)

   Number
0     1.0
1     2.0
2     3.0
3     4.0
4     NaN
5     5.0
6     6.0
7     NaN
8     7.0
9     8.0


True

In [26]:
data = {'Number':[1,2,3,4,np.nan,5,6,np.nan,7,8]}
df = pd.DataFrame(data)
print(df ,"\n\n")
check = df['Number'].isnull()
print(check)

   Number
0     1.0
1     2.0
2     3.0
3     4.0
4     NaN
5     5.0
6     6.0
7     NaN
8     7.0
9     8.0


0    False
1    False
2    False
3    False
4     True
5    False
6    False
7     True
8    False
9    False
Name: Number, dtype: bool

### Count the Number of NAN

In [22]:
df.isnull().sum()

Number    2
dtype: int64

### Count the total number of missing values in entire dataset

In [24]:
df = pd.read_csv("iris.csv")
check = df.isnull().sum().sum()
print(check)

0

### Fill NAN with ZERO

In [25]:
data = {'Number':[1,2,3,np.nan,4,np.nan,6,7,8]}
df = pd.DataFrame(data)
# print(df)
df['Number'] = df['Number'].fillna(0)
print(df)

   Number
0     1.0
1     2.0
2     3.0
3     0.0
4     4.0
5     0.0
6     6.0
7     7.0
8     8.0

# Fill missing values with mean , median, mode

In [27]:
# Method 1: Fill NaN Values in One Column with Mean
# df['col1'] = df['col1'].fillna(df['col1'].mean())


# Method 2: Fill NaN Values in Multiple Columns with Mean
# df[['col1', 'col2']] = df[['col1', 'col2']].fillna(df[['col1', 'col2']].mean())

# Method 3: Fill NaN Values in All Columns with Mean
# df = df.fillna(df.mean())

In [28]:
import numpy as np
import pandas as pd

#create DataFrame with some NaN values
df = pd.DataFrame({'rating': [np.nan, 85, np.nan, 88, 94, 90, 76, 75, 87, 86],
                   'points': [25, np.nan, 14, 16, 27, 20, 12, 15, 14, 19],
                   'assists': [5, 7, 7, np.nan, 5, 7, 6, 9, 9, 5],
                   'rebounds': [11, 8, 10, 6, 6, 9, 6, 10, 10, 7]})

#view DataFrame
df

   rating  points  assists  rebounds
0     NaN    25.0      5.0        11
1    85.0     NaN      7.0         8
2     NaN    14.0      7.0        10
3    88.0    16.0      NaN         6
4    94.0    27.0      5.0         6
5    90.0    20.0      7.0         9
6    76.0    12.0      6.0         6
7    75.0    15.0      9.0        10
8    87.0    14.0      9.0        10
9    86.0    19.0      5.0         7

In [29]:
#fill NaNs with column mean in 'rating' column
df['rating'] = df['rating'].fillna(df['rating'].mean())

#view updated DataFrame 
df

   rating  points  assists  rebounds
0  85.125    25.0      5.0        11
1  85.000     NaN      7.0         8
2  85.125    14.0      7.0        10
3  88.000    16.0      NaN         6
4  94.000    27.0      5.0         6
5  90.000    20.0      7.0         9
6  76.000    12.0      6.0         6
7  75.000    15.0      9.0        10
8  87.000    14.0      9.0        10
9  86.000    19.0      5.0         7

In [30]:
#fill NaNs with column means in 'rating' and 'points' columns
df[['rating', 'points']] = df[['rating', 'points']].fillna(df[['rating', 'points']].mean())

#view updated DataFrame
df

   rating  points  assists  rebounds
0  85.125    25.0      5.0        11
1  85.000    18.0      7.0         8
2  85.125    14.0      7.0        10
3  88.000    16.0      NaN         6
4  94.000    27.0      5.0         6
5  90.000    20.0      7.0         9
6  76.000    12.0      6.0         6
7  75.000    15.0      9.0        10
8  87.000    14.0      9.0        10
9  86.000    19.0      5.0         7

In [31]:
#fill NaNs with column means in each column 
df = df.fillna(df.mean())

#view updated DataFrame
df

   rating  points   assists  rebounds
0  85.125    25.0  5.000000        11
1  85.000    18.0  7.000000         8
2  85.125    14.0  7.000000        10
3  88.000    16.0  6.666667         6
4  94.000    27.0  5.000000         6
5  90.000    20.0  7.000000         9
6  76.000    12.0  6.000000         6
7  75.000    15.0  9.000000        10
8  87.000    14.0  9.000000        10
9  86.000    19.0  5.000000         7